#1.1 Importing the libraries to be used

In [1]:
# We will first begin by importing our pandas library so as to help us in 
# data manipulation and analysis.

import pandas as pd

# as well as the Numpy library
import numpy as np

#1.2 Creating dataframes

To be able to view the data we will create dataframes from csv files using the panda's read_(type) function

In [2]:
# Display the description for our the cells geo data set
# This will enable us understand our dataset

cell_desc = pd.read_excel('/content/cells_geo_description.xlsx')
cell_desc

     Column name                                        Description  Format
0         VILLES                                               City  String
1         STATUS                                  In Service or not  String
2   LOCALISATION                                  in ABIDJAN or not  String
3     DECOUPZONE                                  Geographical Zone  String
4       ZONENAME                                       Name of Zone  String
5      LONGITUDE                                          Longitude   Float
6       LATITUDE                                           Latitude   Float
7         REGION                                             Region  String
8           AREA                                               Area  String
9        CELL_ID                                     ID of the cell  String
10     SITE_CODE  Site (there are several cells per site, severa...  String

In [3]:
# Let's now create a dataframe for the cells geo from the datasets provided

cells_df = pd.read_csv('/content/cells_geo.csv', delimiter= ';', index_col = 0)
cells_df.head(5)

    VILLES      STATUS LOCALISATION  ... AREA     CELL_ID   SITE_CODE
0   ADJAME  In Service      ABIDJAN  ...  NaN  fbb2e75af3  0bb492ef17
1   ADJAME  In Service      ABIDJAN  ...  NaN  1502501d78  0bb492ef17
2   ADJAME  In Service      ABIDJAN  ...  NaN  0c2e182a0c  0bb492ef17
3  ASSINIE  In Service    INTERIEUR  ...  NaN  69bdfc69fd  8a1e6ce31f
4  ASSINIE  In Service    INTERIEUR  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 11 columns]

In [4]:
# Display the description for telecom dataset
# This will enable us understand the dataframe

cdr_desc = pd.read_excel('/content/CDR_description.xlsx')
cdr_desc

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
5  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
6        COUNTRY_A                  Country of party A (useless here)   String
7        COUNTRY_B                  Country of party B (useless here)   String
8          CELL_ID                                     ID of the cell   String
9          SITE_ID                                     ID of the SITE   String

In [5]:
# Creating a data frame using CSV files 

ds1_df = pd.read_csv('/content/Telcom_dataset_1.csv')
ds1_df.head(5)

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [6]:
# Creating a data frame for our second dataset using CSV files 

ds2_df = pd.read_csv('/content/Telcom_dataset2.csv')
ds2_df.head(4)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ

[4 rows x 10 columns]

In [7]:
# Creating a data frame using CSV files 

ds3_df = pd.read_csv('/content/Telcom_dataset3.csv')
ds3_df.head(4)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3

[4 rows x 10 columns]

#1.3 Cleaning the data

Our data is data with a lot of stuff that is irrelevant in our analysis. From mis-spelt words to null values to columns of data values that we are actually going to use.
This section is going to help us clean the data and remain with data that is relevant for manipulation, analysis and providing insight

In [8]:
# We will first look through our descriptions and drop those columns that have 
# rendered irrelevant and not needed in our analysis
# CELL_ON_SITE, COUNTRY_A, COUNTRY_B

# Lets delete the columns that have been marked not needed or useless for 
# the first dataframe
# We will set our dataframe as the dataframe where we are dropping specific 
# columns since we are not going to need the same

ds1_df = ds1_df.drop(columns =['CELL_ON_SITE', 'COUNTRY_A', 'COUNTRY_B']) 
ds1_df.columns
print("This is how our dataframe looks now\n")
ds1_df.head(4)

This is how our dataframe looks now

  PRODUTC  VALUE  ...     CELL_ID     SITE_ID
0   Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  ...  /+cKZKIp41  /+cKZKIp41
2     sms     25  ...  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  ...  +cNeJzsTp3  +cNeJzsTp3

[4 rows x 7 columns]

In [9]:
# Lets delete the columns that have been marked not needed or useless for 
# the first dataframe
# We will set our dataframe as the dataframe where we are dropping specific 
# columns since we are not going to need the same

print(ds2_df.columns)
print("\n")
ds2_df = ds2_df.drop(columns =['CELL_ON_SITE', 'COUNTRY_A', 'COUNTRY_B'], axis = 1) 
ds2_df.columns
print("This is how our dataframe looks now\n")
ds2_df.head(4)

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'CELL_ON_SITE', 'DW_A_NUMBER',
       'DW_B_NUMBER', 'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')


This is how our dataframe looks now

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0     sms      0  ...  +854AcBQT2  +854AcBQT2
1   Voice      0  ...  +854AcBQT2  +854AcBQT2
2     sms      0  ...  +laSrk7g6q  +laSrk7g6q
3   Voice     37  ...  /xvRrCVKoQ  /xvRrCVKoQ

[4 rows x 7 columns]

In [10]:
# Lets delete the columns that have been marked not needed or useless for 
# the first dataframe
# We will set our dataframe as the dataframe where we are dropping specific 
# columns since we are not going to need the same

print(ds3_df.columns)
print("\n")
ds3_df = ds3_df.drop(columns =['CELL_ON_SITE', 'COUNTRY_A', 'COUNTRY_B']) 
ds3_df.columns
print("This is how our dataframe looks now\n")
ds3_df.head(5)

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'CELL_ON_SITE', 'DW_A_NUMBER_INT',
       'DW_B_NUMBER_INT', 'COUNTRY_A', 'COUNTRY_B', 'CELLID', 'SIET_ID'],
      dtype='object')


This is how our dataframe looks now

  PRODUCT  VALUE  ...      CELLID     SIET_ID
0   Voice     61  ...  +38u2u/rfx  +38u2u/rfx
1     sms      0  ...  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  ...  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  ...  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  ...  /eeMklgyJA  /eeMklgyJA

[5 rows x 7 columns]

In [11]:
# We have mis-spelt column names on our data that need to be renamed rightly so
# as to be able to work on our data seamlessly

ds2_df = ds2_df.rename(columns={'DW_A_NUMBER': 'DW_A_NUMBER_INT', 'DW_B_NUMBER': 'DW_B_NUMBER_INT'})
ds2_df

     PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0        sms      0  ...  +854AcBQT2  +854AcBQT2
1      Voice      0  ...  +854AcBQT2  +854AcBQT2
2        sms      0  ...  +laSrk7g6q  +laSrk7g6q
3      Voice     37  ...  /xvRrCVKoQ  /xvRrCVKoQ
4        sms     25  ...  +bO+qkSonO  +bO+qkSonO
...      ...    ...  ...         ...         ...
4996     sms      0  ...  896459aace  b7d00e59e4
4997     sms     25  ...  7e90b35166  211015b14d
4998     sms      0  ...  fe70e431df  c7ea989264
4999    data      0  ...  ffa6759bb2         NaN
5000   Voice      0  ...  8630058aca  b47a998a3e

[5001 rows x 7 columns]

In [12]:
ds1_df = ds1_df.rename(columns={'DATETIME': 'DATE_TIME'})
ds1_df

     PRODUTC  VALUE  ...     CELL_ID     SITE_ID
0      Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1        sms      0  ...  /+cKZKIp41  /+cKZKIp41
2        sms     25  ...  /u0FSD+ahi  /u0FSD+ahi
3      Voice     56  ...  +cNeJzsTp3  +cNeJzsTp3
4      Voice     14  ...  051KhYDCpv  051KhYDCpv
...      ...    ...  ...         ...         ...
4996     sms    100  ...  0c2371d9bc  1e751d08a4
4997   Voice      1  ...  5fb791cf56  65efe2bc62
4998   Voice      0  ...  7773627c12  9ef9616350
4999   Voice      0  ...  3f4af49d6c  969b8d0e39
5000   Voice      7  ...  6f4d9b77a5  ebfc58af70

[5001 rows x 7 columns]

In [13]:
# Our third dataframe has a column spelt wrongly. The column 'SITE_ID
# has been misspelt as 'SIET_ID'
ds3_df = ds3_df.rename(columns={'SIET_ID': 'SITE_ID', 'CELLID': 'CELL_ID'})
ds3_df

     PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0      Voice     61  ...  +38u2u/rfx  +38u2u/rfx
1        sms      0  ...  +Fs4mTvdKx  +Fs4mTvdKx
2      Voice     10  ...  +ZaaZozy/+  +ZaaZozy/+
3        sms      0  ...  +cNeJzsTp3  +cNeJzsTp3
4      Voice     22  ...  /eeMklgyJA  /eeMklgyJA
...      ...    ...  ...         ...         ...
4996   Voice      0  ...  2aa04dcab7  f7d63a29e5
4997   Voice     62  ...  7f1f2f889f  b4ddb9e93c
4998   Voice     32  ...  a4731e780e  d68260ef50
4999   Voice     30  ...  98ed726da2  b4130b54ab
5000   Voice     60  ...  1c11a2fcbb  6d70dae094

[5001 rows x 7 columns]

In [14]:
ds1_df = ds1_df.rename(columns={'PRODUTC': 'PRODUCT'})
ds1_df

     PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0      Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1        sms      0  ...  /+cKZKIp41  /+cKZKIp41
2        sms     25  ...  /u0FSD+ahi  /u0FSD+ahi
3      Voice     56  ...  +cNeJzsTp3  +cNeJzsTp3
4      Voice     14  ...  051KhYDCpv  051KhYDCpv
...      ...    ...  ...         ...         ...
4996     sms    100  ...  0c2371d9bc  1e751d08a4
4997   Voice      1  ...  5fb791cf56  65efe2bc62
4998   Voice      0  ...  7773627c12  9ef9616350
4999   Voice      0  ...  3f4af49d6c  969b8d0e39
5000   Voice      7  ...  6f4d9b77a5  ebfc58af70

[5001 rows x 7 columns]

Let's now output our newly named columns so as to see easily how our dataframes look without having to go all the way up to check what else might have been left out in the cleaning part and more-so our what we have renamed

In [15]:
# Let us output all our dataframes to look at how the column names compare

print("Output for our first dataframe looks like this:\n")
pd.set_option('display.max_columns', None)
print(ds1_df.head(4))
print("")

Output for our first dataframe looks like this:

  PRODUCT  VALUE              DATE_TIME  DW_A_NUMBER_INT  DW_B_NUMBER_INT  \
0   Voice      0  2012-05-06 23:04:37.0  49fae048b547780  1a49f8b0ded9de6
1     sms      0  2012-05-06 23:05:25.0  7a54a6eaee19e65  93343ba6e41af95
2     sms     25  2012-05-06 23:05:41.0  6008887b0207d82  7aacc9709ce0a20
3   Voice     56  2012-05-06 23:05:42.0  7370032e20f4e96  6af4a60e74c91d3

      CELL_ID     SITE_ID
0  /TJNe+Mmtu  /TJNe+Mmtu
1  /+cKZKIp41  /+cKZKIp41
2  /u0FSD+ahi  /u0FSD+ahi
3  +cNeJzsTp3  +cNeJzsTp3

In [16]:
# Let us output all our dataframes to look at how the column names compare

print("Output for our second dataframe looks like this:\n")
pd.set_option('display.max_columns', None)
print(ds2_df.head(4))
print("")

Output for our second dataframe looks like this:

  PRODUCT  VALUE              DATE_TIME  DW_A_NUMBER_INT  DW_B_NUMBER_INT  \
0     sms      0  2012-05-07 23:02:06.0  32255675c3b6fe3  1aa7ae01386e9fb
1   Voice      0  2012-05-07 23:03:44.0  ff16d6ac74c1c64  87d87309c15a8c9
2     sms      0  2012-05-07 23:04:06.0  98d9f2fb5ff624b  93343ba6e41af95
3   Voice     37  2012-05-07 23:04:48.0  3f9c8a33ec7be1f  7d05a38f89c49d8

      CELL_ID     SITE_ID
0  +854AcBQT2  +854AcBQT2
1  +854AcBQT2  +854AcBQT2
2  +laSrk7g6q  +laSrk7g6q
3  /xvRrCVKoQ  /xvRrCVKoQ

In [17]:
# Let us output all our dataframes to look at how the column names compare

print("Output for our third dataframe looks like this:\n")
pd.set_option('display.max_columns', None)
print(ds3_df.head(4))
print("")

Output for our third dataframe looks like this:

  PRODUCT  VALUE              DATE_TIME  DW_A_NUMBER_INT  DW_B_NUMBER_INT  \
0   Voice     61  2012-05-08 23:01:28.0  966f68353622feb  ffd53a3bb2db6f1
1     sms      0  2012-05-08 23:01:31.0  a0a597384c612d7  cf3b218f1dde792
2   Voice     10  2012-05-08 23:02:59.0  5441a9a58c97132  52f8b299515b9b7
3     sms      0  2012-05-08 23:03:04.0  8ab8b9ed6989f61  e09e736e46c5c3d

      CELL_ID     SITE_ID
0  +38u2u/rfx  +38u2u/rfx
1  +Fs4mTvdKx  +Fs4mTvdKx
2  +ZaaZozy/+  +ZaaZozy/+
3  +cNeJzsTp3  +cNeJzsTp3

**Looking and dropping the duplicate values**

In [18]:
# Our data is very likely to have duplicates. An important part of data analysis 
# is analyzing duplicate Values and removing them. 
# It is important to do away with these duplicates before we can start 
# analysing our data.

ds1_df.duplicated().value_counts()

False    4919
True       82
dtype: int64

In [19]:
# We do the same for our 2nd dataset
ds2_df.duplicated().value_counts()

False    4923
True       78
dtype: int64

In [20]:
# 
ds3_df.duplicated().value_counts()

False    4908
True       93
dtype: int64

In [21]:
cells_df.duplicated().value_counts()

False    3931
True       43
dtype: int64

In [22]:
ds1_df.drop_duplicates(inplace=True)

In [23]:
ds2_df.drop_duplicates(inplace=True)

In [24]:
ds3_df.drop_duplicates(inplace=True)

In [25]:
cells_df.drop_duplicates(inplace=True)

**Dealing with null values in the data.**

In [26]:
# Lets check to see whether we have null values in our cells_geo dataset

cells_df.isnull().sum().sort_values()

VILLES           0
LOCALISATION     0
DECOUPZONE       0
LONGITUDE        0
LATITUDE         0
REGION           0
CELL_ID          0
SITE_CODE        0
ZONENAME         6
AREA            23
STATUS          41
dtype: int64

In [27]:
# Lets check to see whether we have null values in our first dataset

ds1_df.isnull().sum().sort_values()

PRODUCT              0
VALUE                0
DATE_TIME            0
DW_A_NUMBER_INT      0
DW_B_NUMBER_INT      0
CELL_ID              0
SITE_ID            704
dtype: int64

In [28]:
# Lets check to see whether we have null values in our second dataset

ds2_df.isnull().sum().sort_values()

PRODUCT              0
VALUE                0
DATE_TIME            0
DW_A_NUMBER_INT      0
DW_B_NUMBER_INT      0
CELL_ID              0
SITE_ID            660
dtype: int64

In [29]:
# Lets check to see whether we have null values in our third dataset

ds3_df.isnull().sum().sort_values()

PRODUCT              0
VALUE                0
DATE_TIME            0
DW_A_NUMBER_INT      0
DW_B_NUMBER_INT      0
CELL_ID              0
SITE_ID            597
dtype: int64

#1.4 Merging the dataframes

In [30]:
telecom_df = pd.concat([ds1_df, ds2_df, ds3_df], axis=0)
telecom_df.shape

(14750, 7)

In [31]:
telecom_df.head()

,PRODUCT,VALUE,DATE_TIME,DW_A_NUMBER_INT,DW_B_NUMBER_INT,CELL_ID,SITE_ID
0,Voice,0,2012-05-06 23:04:37.0,49fae048b547780,1a49f8b0ded9de6,/TJNe+Mmtu,/TJNe+Mmtu
1,sms,0,2012-05-06 23:05:25.0,7a54a6eaee19e65,93343ba6e41af95,/+cKZKIp41,/+cKZKIp41
2,sms,25,2012-05-06 23:05:41.0,6008887b0207d82,7aacc9709ce0a20,/u0FSD+ahi,/u0FSD+ahi
3,Voice,56,2012-05-06 23:05:42.0,7370032e20f4e96,6af4a60e74c91d3,+cNeJzsTp3,+cNeJzsTp3
4,Voice,14,2012-05-06 23:06:29.0,966ba4656e38e62,02aa736ee555d5c,051KhYDCpv,051KhYDCpv

In [32]:
mtn = pd.merge(telecom_df, cells_df, how='inner', left_on=['SITE_ID'], right_on=['SITE_CODE'])
mtn

,PRODUCT,VALUE,DATE_TIME,DW_A_NUMBER_INT,DW_B_NUMBER_INT,CELL_ID_x,SITE_ID,VILLES,STATUS,LOCALISATION,DECOUPZONE,ZONENAME,LONGITUDE,LATITUDE,REGION,AREA,CELL_ID_y,SITE_CODE
0,sms,0,2012-05-07 00:00:00.0,8118c3aa53d6c7b,1d103ea638ad1f0,5d9dc897f7,1b5540c02d,BOUAKE,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-5.027139,7.718417,VALLEE DU BANDAMA,CENTRE NORTH,24ccdda3d5,1b5540c02d
1,sms,0,2012-05-07 00:00:00.0,8118c3aa53d6c7b,1d103ea638ad1f0,5d9dc897f7,1b5540c02d,BOUAKE,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-5.027139,7.718417,VALLEE DU BANDAMA,CENTRE NORTH,ebfc58af70,1b5540c02d
2,sms,0,2012-05-07 00:00:00.0,8118c3aa53d6c7b,1d103ea638ad1f0,5d9dc897f7,1b5540c02d,BOUAKE,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-5.027139,7.718417,VALLEE DU BANDAMA,CENTRE NORTH,ba8ce6e4ef,1b5540c02d
3,sms,0,2012-05-07 00:00:00.0,8118c3aa53d6c7b,1d103ea638ad1f0,5d9dc897f7,1b5540c02d,BOUAKE,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-5.027139,7.718417,VALLEE DU BANDAMA,CENTRE NORTH,c2545171dc,1b5540c02d
4,sms,0,2012-05-07 00:00:00.0,8118c3aa53d6c7b,1d103ea638ad1f0,5d9dc897f7,1b5540c02d,BOUAKE,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-5.027139,7.718417,VALLEE DU BANDAMA,CENTRE NORTH,f15bd5483f,1b5540c02d
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
49697,Voice,17,2012-05-09 00:01:42.0,22e493a92442b73,c9e2c9c2fa3795a,2f50f4a1fb,cc45940406,ADJAME,In Service,ABIDJAN,Abidjan_CENTRE,ZONE B - Abidjan_CENTRE,-4.023247,5.349442,LAGUNE,ABIDJAN NORTH,c179f33d5e,cc45940406
49698,Voice,17,2012-05-09 00:01:42.0,22e493a92442b73,c9e2c9c2fa3795a,2f50f4a1fb,cc45940406,ADJAME,In Service,ABIDJAN,Abidjan_CENTRE,ZONE B - Abidjan_CENTRE,-4.023247,5.349442,LAGUNE,ABIDJAN NORTH,0a3f751619,cc45940406
49699,sms,0,2012-05-09 00:01:43.0,32e2e7c90a9b0e9,32e2e7c90a9b0e9,25c671778e,ab91f5b21d,DIABO,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-5.171778,7.777056,VALLEE DU BANDAMA,CENTRE NORTH,0427a26d34,ab91f5b21d
49700,sms,0,2012-05-09 00:01:43.0,32e2e7c90a9b0e9,32e2e7c90a9b0e9,25c671778e,ab91f5b21d,DIABO,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-5.171778,7.777056,VALLEE DU BANDAMA,CENTRE NORTH,7c72293cf2,ab91f5b21d
49701,sms,0,2012-05-09 00:01:43.0,32e2e7c90a9b0e9,32e2e7c90a9b0e9,25c671778e,ab91f5b21d,DIABO,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-5.171778,7.777056,VALLEE DU BANDAMA,CENTRE NORTH,be18b5b981,ab91f5b21d

In [33]:
mtn.isnull().sum()

PRODUCT              0
VALUE                0
DATE_TIME            0
DW_A_NUMBER_INT      0
DW_B_NUMBER_INT      0
CELL_ID_x            0
SITE_ID              0
VILLES               0
STATUS             677
LOCALISATION         0
DECOUPZONE           0
ZONENAME            18
LONGITUDE            0
LATITUDE             0
REGION               0
AREA               256
CELL_ID_y            0
SITE_CODE            0
dtype: int64

# Analysis

In [64]:
# Lets look at the traffic in regions so that we can later on be able to find 
# what cities are the most active

traffic = mtn['REGION'].value_counts()
traffic[0:10]

LAGUNE               32547
LACS                  2408
BAS SASSANDRA         2327
HAUT SASSANDRA        2277
VALLEE DU BANDAMA     1551
SUD BANDAMA           1518
SAVANE                 980
FROMAGER               904
WORODOUGOU             792
18 MONTAGNES           765
Name: REGION, dtype: int64

In [36]:
# Get the zones with the most traffic
mtn['ZONENAME'].value_counts()

ZONE C - Abidjan_OUEST     10296
ZONE E - Abidjan_NORD       6660
ZONE B - Grand-SUD          5545
ZONE B - Abidjan_EST        4838
ZONE D - Abidjan_SUD        4642
ZONE D - Grand-OUEST        4314
ZONE A - Abidjan_CENTRE     4132
ZONE A - Grand-NORD         3928
ZONE E - SUD-OUEST          2993
ZONE C - Grand-EST          1748
ZONE D - Abidjan_EST         186
OKAHOTEL                     120
NPONON                        72
WILLIAMSVILLE2                40
ZONE C - Abidjan_EST          27
ZONE A - Abidjan_OUEST        21
PALMABINGERVILLE              21
ZONE B - Abidjan_OUEST        18
ZONE A - Grand-SUD            18
ZONE B - Grand-EST            18
ZONE C - Abidjan_SUD          15
ZONE A - Grand-EST             6
ZONE D - Grand-SUD             6
ZONE B - Abidjan_SUD           6
ZONE B - Abidjan_Nord          3
AGBANNEW                       3
ZONE B - Abidjan-EST           3
ZONE B - Grand-NORD            3
ZONE B - Abidjan_CENTRE        2
Name: ZONENAME, dtype: int64

In [52]:
cities = mtn['VILLES'].count()
cities

49702

In [66]:
# From our merged dataframe, let us look for the product that's most used

mtn['PRODUCT'].max()

'sms'

In [57]:
# Let us look at the cities that have had the most traffic
mtn[['VILLES','LOCALISATION','DECOUPZONE']].value_counts().head(10)

VILLES        LOCALISATION  DECOUPZONE
YOPOUGON      ABIDJAN       Abidjan_OUEST     8432
ABOBO         ABIDJAN       Abidjan_NORD      5967
COCODY        ABIDJAN       Abidjan_EST       2878
YAMOUSSOUKRO  INTERIEUR     Grand-SUD         2076
TREICHVILLE   ABIDJAN       Abidjan_CENTRE    2026
KOUMASSI      ABIDJAN       Abidjan_SUD       1756
DALOA         INTERIEUR     Grand-OUEST       1747
ADJAME        ABIDJAN       Abidjan_EST       1642
ATTECOUBE     ABIDJAN       Abidjan_OUEST     1563
PORT-BOUET    ABIDJAN       Abidjan_SUD       1423
dtype: int64